### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ssm_parameter.deploy_api_service_name will be updated in-place
  ~ resource "aws_ssm_parameter" "deploy_api_service_name" {
        id          = "/gost/staging/deploy-config/api/service-name"
        name        = "/gost/staging/deploy-config/api/service-name"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (7 unchanged attributes hidden)
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ tags_all                           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:5" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
-               {
-                   cpu                    = 0
-                   environment            = [
-                       {
-                           name  = "API_DOMAIN"
-                           value = "https://api.staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "AUDIT_REPORT_BUCKET"
-                           value = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
                        },
-                       {
-                           name  = "DATA_DIR"
-                           value = "/var/data"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_DIGEST"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_SCRAPER"
-                           value = "false"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DATE_RANGE"
-                           value = "7"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DELAY"
-                           value = "1000"
                        },
-                       {
-                           name  = "NODE_OPTIONS"
-                           value = "--max_old_space_size=1024"
                        },
-                       {
-                           name  = "NOTIFICATIONS_EMAIL"
-                           value = "grants-notifications@staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "VUE_APP_GRANTS_API_URL"
-                           value = "https://74pah5zi58.execute-api.us-west-2.amazonaws.com"
                        },
-                       {
-                           name  = "WEBSITE_DOMAIN"
-                           value = "https://staging.grants.usdr.dev"
                        },
                    ]
-                   essential              = true
-                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:latest"
-                   linuxParameters        = {
-                       capabilities       = {
-                           add  = []
-                           drop = []
                        }
-                       devices            = []
-                       initProcessEnabled = true
-                       tmpfs              = []
                    }
-                   logConfiguration       = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "gost-staging-api-20230217010414234200000007"
-                           awslogs-region        = "us-west-2"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints            = [
-                       {
-                           containerPath = "/var/data"
-                           readOnly      = false
-                           sourceVolume  = "data"
                        },
                    ]
-                   name                   = "api"
-                   portMappings           = [
-                       {
-                           containerPort = 3000
-                           hostPort      = 3000
-                           protocol      = "tcp"
                        },
                    ]
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "COOKIE_SECRET"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret"
                        },
-                       {
-                           name      = "POSTGRES_URL"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string"
                        },
                    ]
-                   volumesFrom            = []
                },
-               {
-                   cpu                    = 0
-                   environment            = [
-                       {
-                           name  = "DD_APM_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "ECS_FARGATE"
-                           value = "true"
                        },
                    ]
-                   essential              = false
-                   image                  = "public.ecr.aws/datadog/agent:latest"
-                   mountPoints            = []
-                   name                   = "datadog"
-                   portMappings           = []
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "DD_API_KEY"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
                        },
                    ]
-                   volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
-       tags                     = {} -> null
      ~ tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (8 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy.task["rw-arpa-audit-reports"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-staging-api-ECSTask-2023021701041477300000000a:rw-arpa-audit-reports"
        name   = "rw-arpa-audit-reports"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:PutObject",
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::gost-staging-arpaauditreports-357150818708-us-west-2-api/*"
-                       Sid      = "ReadWriteBucketObjects"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.access_arpa_reports_bucket_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket.default[0] will be created
+   resource "aws_s3_bucket" "default" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Attributes" = "357150818708-us-west-2-api"
+           "Name"       = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
+           "Namespace"  = "gost-staging"
        }
+       tags_all                    = {
+           "Attributes" = "357150818708-us-west-2-api"
+           "Name"       = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
+           "Namespace"  = "gost-staging"
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket.default[0] (deposed object 45bfc9e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_s3_bucket" "default" {
-       arn                         = "arn:aws:s3:::gost-staging-arpaauditreports-357150818708-us-west-2-api" -> null
-       bucket                      = "gost-staging-arpaauditreports-357150818708-us-west-2-api" -> null
-       bucket_domain_name          = "gost-staging-arpaauditreports-357150818708-us-west-2-api.s3.amazonaws.com" -> null
-       bucket_regional_domain_name = "gost-staging-arpaauditreports-357150818708-us-west-2-api.s3.us-west-2.amazonaws.com" -> null
-       force_destroy               = false -> null
-       hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
-       id                          = "gost-staging-arpaauditreports-357150818708-us-west-2-api" -> null
-       object_lock_enabled         = false -> null
-       region                      = "us-west-2" -> null
-       request_payer               = "BucketOwner" -> null
-       tags                        = {
-           "Attributes" = "357150818708-us-west-2-api"
-           "Name"       = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
-           "Namespace"  = "gost-staging"
        } -> null
-       tags_all                    = {
-           "Attributes" = "357150818708-us-west-2-api"
-           "Name"       = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
-           "Namespace"  = "gost-staging"
        } -> null

-       grant {
-           id          = "908fcaa3526bcd94649f1b7d5e57a2d26eed8383a46040a685ea6c39d3b3f6c0" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_acl.default[0] will be created
+   resource "aws_s3_bucket_acl" "default" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           id     = "rule-1"
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 1
            }

+           expiration {
+               days                         = 14
+               expired_object_delete_marker = (known after apply)
            }

+           filter {
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_ownership_controls.default[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_policy.default[0] will be created
+   resource "aws_s3_bucket_policy" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_public_access_block.default[0] will be created
+   resource "aws_s3_bucket_public_access_block" "default" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           bucket_key_enabled = false

+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_versioning.default[0] will be created
+   resource "aws_s3_bucket_versioning" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-staging-grants_scraper-2023021701041523320000000b:terraform-20230217010528091000000012"
        name   = "terraform-20230217010528091000000012"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-staging-grants_scraper-20230217010528095600000013"
        name                         = "gost-staging-grants_scraper-20230217010528095600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:5" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.website.module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E1JJ5NAYUQCPD6"
        tags                           = {}
        # (21 unchanged attributes hidden)

-       custom_error_response {
-           error_caching_min_ttl = 0 -> null
-           error_code            = 403 -> null
-           response_code         = 403 -> null
-           response_page_path    = "/errors/403.html" -> null
        }
-       custom_error_response {
-           error_caching_min_ttl = 0 -> null
-           error_code            = 404 -> null
-           response_code         = 404 -> null
-           response_page_path    = "/errors/404.html" -> null
        }

        # (7 unchanged blocks hidden)
    }

Plan: 9 to add, 6 to change, 2 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: `Terraform CI`*